{"id": "01139a548ef6b90d762ef98709d552e8ad38de131dfe9e5902805e0a47183302", "scope": "realm:cabin/layer:surface/topic:general", "content": "### [Sovereign Search: Wei Changhui Taiping Rebellion implications]\n\n1. **Taiping Rebellion - Wikipedia**\n   URL: https://en.wikipedia.org/wiki/Taiping_Rebellion\n   Snippet: The Taiping rebellion prompted the government's initially successful \"Self-Strengthening Movement\", but continued social and religious unrest exacerbated ethnic disputes and accelerated the rise of provincial powers.\n\n2. **Révolte des Taiping — Wikipédia**\n   URL: https://fr.wikipedia.org/wiki/Révolte_des_Taiping\n   Snippet: Wei Changhui et Qin Rigang sont eux-mêmes assassinés peu après, sur ordre de Hong Xiuquan, pour avoir essayé d'assassiner aussi Shi Dakai à son retour. Cet évènement est sans aucun doute le point de départ de la désagrégation de la cause Taiping , désormais en proie à la...\n\n3. **Taiping Rebellion - New World Encyclopedia**\n   URL: https://www.newworldencyclopedia.org/entry/Taiping_Rebellion\n   Snippet: The Taiping Rebellion was a large-scale revolt, waged from 1851 until 1864, against the authority and forces of the Qing Empire in China, conducted by an army and civil administration inspired by Hakka, self-proclaimed mystics named Hong Xiuquan and Yang Xiuqing.\n\n4. **Taiping Rebellion | Causes, Effects, & Facts | Britannica**\n   URL: https://www.britannica.com/event/Taiping-Rebellion\n   Snippet: Taiping Rebellion , political and religious upheaval in China that was probably the most important event in China in the 19th century. It lasted from 1850 to 1864 and took an estimated 20 million lives. Read here to learn more about the Taiping Rebellion .\n\n5. **Reconsiderations the Taiping Rebellion of the Early Modern**\n   URL: https://davidpublisher.com/Public/uploads/Contribute/63639e335c81a.pdf\n   Snippet: Taiping Rebellion is considered as a millenarian movement due to its “ Taiping ” ideal, coming of the savior, mass appeal and crusade against evil.Shi Dakai and Wei Changhui were already rich before joining the Taiping Rebellion .\n", "source": "duckduckgo_search", "timestamp": 1770608417.5960295}