{"id": "334783f2c4a3dae9f2d292b5bd91a262c67ee8cac63b6241a43c921fcd00e45c", "scope": "realm:cabin/layer:surface/topic:general", "content": "### [Sovereign Search: decline in insect biomass impact on biosphere]\n\n1. **Decline in insect populations - Wikipedia**\n   URL: https://en.wikipedia.org/wiki/Decline_in_insect_populations\n   Snippet: 2 weeks ago - In a 2019 review, David Wagner noted that currently the Holocene extinction is seeing animal species loss at about 100–1,000 times the planet's normal background rate, and that various studies found a similar, or possibly even faster extinction rate for insects. Wagner opines that serious though this biodiversity loss is, it is the decline in abundance that will have the most serious ecological impact. In theory it is possible for the three metrics to be independent. For instance, a decline in biomass might not involve a decrease in abundance or diversity if all that was happening was that typical insects were getting smaller.\n\n2. **More than 75 percent decline over 27 years in total flying insect biomass in protected areas | PLOS One**\n   URL: https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0185809\n   Snippet: October 18, 2017 - Global declines in insects have sparked wide interest among scientists, politicians, and the general public. Loss of insect diversity and abundance is expected to provoke cascading effects on food webs and to jeopardize ecosystem services .\n\n3. **Assessing changes in insect biomass and biodiversity at the ...**\n   URL: https://euc.yorku.ca/research-spotlight/assessing-changes-in-insect-biomass-and-biodiversity-at-the-long-point-world-biosphere-reserve-lpwbr/\n   Snippet: September 25, 2024 - Drivers of this decline are positively correlated with variations in total precipitation . Calculating insect biomass across the months of May and June from 2021 to 2023 showed varied results dependent upon fluctuations in maximum temperature.\n\n4. **Plummeting insect numbers 'threaten collapse of nature' | Insects | The Guardian**\n   URL: https://www.theguardian.com/environment/2019/feb/10/plummeting-insect-numbers-threaten-collapse-of-nature\n   Snippet: October 29, 2021 - “We wanted to really wake people up” and the reviewers and editor agreed, he said. “When you consider 80% of biomass of insects has disappeared in 25-30 years , it is a big concern.”\n\n5. **Weather explains the decline and rise of insect biomass over 34 years | Nature**\n   URL: https://www.nature.com/articles/s41586-023-06402-z\n   Snippet: September 27, 2023 - Insects have a pivotal role in ecosystem function, thus the decline of more than 75% in insect biomass in protected areas over recent decades in Central Europe1 and elsewhere 2,3 has alarmed the public, pushed decision-makers4 and stimulated ...\n", "source": "duckduckgo_search", "timestamp": 1770596731.416314}