{"id": "ac5e0d01b07eb6d8467c87db946a46b7c376aaf4ad85b8da29a0a9d2b8271da3", "scope": "realm:cabin/layer:surface/topic:general", "content": "### [Sovereign Search: Old Persian cuneiform]\n\n1. **Old Persian cuneiform**\n   URL: https://en.wikipedia.org/wiki/Old_Persian_cuneiform\n   Snippet: Old Persian cuneiform is a semi-alphabetic cuneiform script that was the primary script for Old Persian. Texts written in this cuneiform have been found in Iran (Persepolis, Susa, Hamadan, Kharg Island), Armenia, Romania (Gherla), Turkey (Van Fortress), and along the Suez Canal. They are mostly inscriptions from the time period of Darius I, such as the DNa inscription, as well as his son, Xerxes I. Later kings down to Artaxerxes III used more recent forms of the language classified as \"pre-Middle Persian\".\n\n2. **Old Persian cuneiform - grokipedia.com**\n   URL: https://grokipedia.com/page/Old_Persian_cuneiform\n   Snippet: Old Persian cuneiform is a semi-syllabic writing system adapted from earlier Mesopotamian cuneiform traditions, specifically influenced by Akkadian and Elamite scripts, and used to record the Old Persian language, an ancient Iranian tongue spoken by the Achaemenid rulers.\n\n3. **Old Persian Cuneiform - Omniglot Ideas from Pinterest Images Old Persian Language : dictionary, grammar, texts • Lexilogos OLD PERSIAN TEXTS - Avesta Old Persian [CDLI Wiki] Persian Online – Grammar & Resources » The Old Persian Script Old Persian cuneiform - grokipedia.com**\n   URL: https://www.omniglot.com/writing/opcuneiform.htm\n   Snippet: See full list on omniglot.com Old Persian , the language used in the cuneiform inscriptions of Achaemenian dynasty and the vernacular of the Achaemenian elite. Old Persian was spoken in southwestern Persia, an area known as Persis, and belongs to the Iranian branch or the Indo-Aryan family of languages. See full list on omniglot.com Details of the Old Persian script and language http://en.wikipedia.org/wiki/Old_Persian_cuneiform http://en.wikipedia.org/wiki/Old_Persian_language http://sites.la.utexas.edu/persian_online_resources/history-of-the-language/ old - persian -script/ Old Persian cuneiform fonts https://www.wazu.jp/gallery/Fonts_OldPersianC.html https://www.fontspace.com/c... See full list on omniglot.com Akkadian, Elamite, Hittite, Old Persian Cuneiform , Sumerian, Ugaritic Page last modified: 01.06.21 [top] You can support this site by Buying Me A Coffee, and if you like what you see on this page, you can use the buttons below to share it with people you know. If you like this site and find it useful, you can support it by making a donation via Pay... See full list on omniglot.com Learn about the mixed writing system used by the Achaemenian dynasty in Persia, with logograms, numerals and alphabet charts. See sample text, transliteration, translation and links to related resources. See full list on omniglot.com View all Lexilogos provides resources for learning and studying Old Persian, the language of the Achaemenid Empire (6th-4th century BC). Find dictionaries, grammars, texts, inscriptions, and keyboard for typing with cuneiform signs. Feb 24, 2022 · The Achaemenian Kings left extensive cuneiform inscriptions in Old Persian dated roughly between 600 BCE and 300 BCE. They also left ruins which have been described as the most grandiose of the ancient world. Learn about the history, features, and writing system of the Old Persian cuneiform script, the latest and simplest version of the cuneiform script. Find out who invented it, how it differs from Mesopotamian cuneiform, and what are its sources and references. After Darius came to power around 522 BC, one of his many contributions to the Persian Empire (and Persian culture) was the invention of the Old Persian cuneiform . Old Persian cuneiform is a semi-syllabic writing system adapted from earlier Mesopotamian cuneiform traditions, specifically influenced by Akkadian and Elamite scripts, and used to record the Old Persian language, an ancient Iranian tongue spoken by the Achaemenid rulers.\n\n4. **Old Persian Language : dictionary, grammar, texts • Lexilogos**\n   URL: https://www.lexilogos.com/english/persian_old.htm\n   Snippet: Lexilogos provides resources for learning and studying Old Persian, the language of the Achaemenid Empire (6th-4th century BC). Find dictionaries, grammars, texts, inscriptions, and keyboard for typing with cuneiform signs.\n\n5. **OLD PERSIAN TEXTS - Avesta**\n   URL: https://avesta.org/op/op.htm\n   Snippet: Feb 24, 2022 · The Achaemenian Kings left extensive cuneiform inscriptions in Old Persian dated roughly between 600 BCE and 300 BCE. They also left ruins which have been described as the most grandiose of the ancient world.\n", "source": "duckduckgo_search", "timestamp": 1770633923.133682}