{"id": "e1dcb75b0d789467f6e3047b8f963bbbc12f4d3a85b8c3182581f0ed0d7a00c9", "scope": "realm:cabin/layer:surface/topic:general", "content": "### [Sovereign Search: Ed Buck allegations]\n\n1. **Ed Buck - Wikipedia**\n   URL: https://en.wikipedia.org/wiki/Ed_Buck\n   Snippet: On September 17, 2019, Buck was arrested and charged with three counts of battery causing serious injury, administering methamphetamine and maintaining a drug house. He was convicted of nine federal charges in 2021; on April 14, 2022, Buck was sentenced to 30 years in prison. [2]\n\n2. **Grand Jury Charges Ed Buck with Four Additional Felonies ...**\n   URL: https://www.justice.gov/usao-cdca/pr/grand-jury-charges-ed-buck-four-additional-felonies-including-he-enticed-victims-travel\n   Snippet: Aug 4, 2020 · Buck , 65, was arrested in September 2019 after being charged in United States District Court with providing methamphetamine to a man who died after receiving the drug intravenously. Since that time, federal authorities have continued to investigate Buck for additional crimes.\n\n3. **Ed Buck Sentenced to 30 Years in Federal Prison on Drug ... Ed Buck Faces Four Additional Federal Charges Alleging Drug ... Pasadena Appeals Panel Rejects Ed Buck’s Appeal of Sentence ... Ed Buck case: Federal charge filed against Democratic donor ... It took two years to arrest Democratic donor Ed Buck despite ...**\n   URL: https://attorneyatlawmagazine.com/legal/case-update/ed-buck-sentenced-to-30-years-in-federal-prison-on-drug-distribution-and-prostitution-charges\n   Snippet: Gemmel Moore, 26, flew to Los Angeles from Texas on July 27, 2017. Buck paid for his airline ticket. Later that day, a 911 call was made to the police. Sheriff’s deputies responded. Buck told them that Moore had overdosed on methamphetamine. Coroner investigators found Moore lying on a mattress, naked except for his socks. Porn was playing on a tel... See full list on attorneyatlawmagazine.com Timothy Dean, 55, was a former basketball player who worked as a fashion consultant at Saks Fifth Avenue. He went to Buck ’s apartment on January 7, 2019. One hour later, he had overdosed. Buck called 911. Before any responders arrived, Buck cleaned up Dean’s blood and vomit. He also tossed syringes and pipes out a window. Like Moore 18 months earli... See full list on attorneyatlawmagazine.com Later that year, at 5:20 am on September 11, a man went into a gas station three blocks from Buck ’s apartment. He told the gas station owner he thought he was having a heart attack. The owner called 911. The man, Dane Brown, told the responding police and medics that Buck had injected methamphetamine into him. Brown wanted an ambulance, but Dean re... See full list on attorneyatlawmagazine.com The federal grand jury in the United States District for the Central District of California indicted Buck . The grand jury charged Buck with nine felony offenses (in a superseding indictment; the original indictment had five counts): 1. Two counts of distributing methamphetamine resulting in death 2. Four counts of distribution of methamphetamine 3.... See full list on attorneyatlawmagazine.com His attorney told District Court Judge Christina Snyder that Buck ’s crimes were attributed to his drug addiction at his sentencing. The attorney also made (uncorroborated) allegations that Buck’s father and several Catholic priests sexually abused Buck as a child. The attorney requested that Buck be sentenced to 10 years in jail. That would let him... See full list on attorneyatlawmagazine.com Aug 5, 2020 · Former West Hollywood resident Ed Buck , who was indicted last year in connection with the death by overdose of 26-year-old Gemmel Moore at his WeHo apartment on Laurel Avenue, was slapped with four additional federal charges alleging distributing of drugs for nearly a decade and enticing two people to cross state lines to California to Oct 21, 2024 · A three-judge panel of the U.S. 9th Circuit Court of Appeals affirmed the lower court’s 30-year prison sentence for Ed Buck , who was convicted of nine felony counts stemming from the deaths of... Sep 19, 2019 · WEST HOLLYWOOD, Calif. (KABC) -- A federal charge has been filed against Democratic donor Ed Buck for allegedly providing the drugs that led to the death of 26-year-old Gemmel Moore at Buck's... Sep 29, 2019 · Ed Buck appears in court on charges of running a drug den in his West Hollywood apartment. Two men have died in his home since 2017, and others have claimed he forcibly injected them with...\n", "source": "duckduckgo_search", "timestamp": 1770567249.3353713}